<?php 
	echo M_PI."<br />".M_E."<br />";
	$x = -15;
	echo abs ($x)."<br />"; // модуль числа
	$y = 49.40354;
	echo round ($y, 3)."<br />"; 
	echo ceil ($y)."<br />"; // округление к большему
	echo floor ($y)."<br />"; // округление к меньшему

	echo mt_rand (1, 20)."<br />"; // случайное число от 1 до 20
	echo min (12, 23, -2, -5, 19, -4, 0)."<br />"; // минимальное значение
	echo max (12, 23, -2, -5, 19, -4, 0)."<br />"; // находит макс значение

	$z = 4;

	echo sin ($z)."<br />"; // синус 
	echo sqrt($z)."<br />";

?>
